Catalogs/Профили.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<Catalog>
		<Properties>
			<Name>Профили</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипПрофиля</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПрофилей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РеквизитыПрофиля</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПараметрыШагов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НаборПрофилей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Профиль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Профили</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеПропускатьПриОшибке</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Профили/Ext/ObjectModule.bsl
#Область ПрограммныйИнтерфейс

Процедура ОбновитьРеквизиты() Экспорт
	
	МетаданныеМодуля = ПолучитьОбработкуПоТипуПрофиля()
							.Создать()
							.Метаданные();
	Для каждого Реквизит из МетаданныеМодуля.Реквизиты Цикл
		
		НайденнаяСтрока = РеквизитыПрофиля.Найти(Реквизит.Имя, "Реквизит");
		Если НЕ НайденнаяСтрока = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		РеквизитыПрофиля.Добавить().Реквизит = Реквизит.Имя;
	КонецЦикла;
	
КонецПроцедуры

Процедура ВыполнитьТекущийСценарий() Экспорт
	
	ТекущийМодуль = ПолучитьОбработкуПоТипуПрофиля().Создать();
	ЗаполнитьТекущуюОбработкуИзПрофиля(ТекущийМодуль);
	ТекущийМодуль.ВыполнитьСценарий();
	
КонецПроцедуры

Функция ПолучитьОбработкуПоТипуПрофиля() Экспорт
	
	ИдентификаторПрофиля = ИдентификаторПеречисленияПоСсылке(ТипПрофиля);
	Возврат Обработки["ТипПрофиля_" + ИдентификаторПрофиля];
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий



#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИдентификаторПеречисленияПоСсылке(ЗначениеПеречисления) 
	
	ИмяПеречисления = ЗначениеПеречисления.Метаданные().Имя;
	ИндексЗначенияПеречисления = Перечисления[ИмяПеречисления].Индекс(ЗначениеПеречисления);
	Возврат Метаданные.Перечисления[ИмяПеречисления].ЗначенияПеречисления[ИндексЗначенияПеречисления].Имя;

КонецФункции

Процедура ЗаполнитьТекущуюОбработкуИзПрофиля(ТекущаяОбработка)
	
	// шапка
	СтруктураПараметров = Новый Структура;
	Для каждого Строка из РеквизитыПрофиля Цикл
		ИмяРеквизита = Строка.Реквизит;
		СтруктураПараметров.Вставить(ИмяРеквизита, Строка.Значение.ЗначениеПараметра);
	КонецЦикла;
	
	ЗаполнитьЗначенияСвойств(ТекущаяОбработка, СтруктураПараметров);
	
	// табличные части
	Для каждого ТабличнаяЧастьОбработки из ТекущаяОбработка.Метаданные().ТабличныеЧасти Цикл
		ИмяТЧ = ТабличнаяЧастьОбработки.Имя;
		Если Метаданные().ТабличныеЧасти.Найти(ИмяТЧ) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ТекущаяОбработка[ИмяТЧ].Загрузить(ЭтотОбъект[ИмяТЧ].Выгрузить());
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
